In [1]:
import numpy as np
import pandas as pd

Handle missing values

üìå What Counts as ‚ÄúMissing‚Äù in Pandas?
None, NaN (Not a Number), and NaT (Not a Time) are all treated as missing values.

In [2]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', None, None],
    'Age': [25, None, 35, None],
    'Salary': [50000, 60000, None, None],
    'JoinDate': [pd.Timestamp('2024-01-10'), pd.NaT, pd.Timestamp('2024-03-15'), None]
})
df

    Name   Age   Salary   JoinDate
0  Alice  25.0  50000.0 2024-01-10
1    Bob   NaN  60000.0        NaT
2   None  35.0      NaN 2024-03-15
3   None   NaN      NaN        NaT

.isnull() ‚Äì Detect missing values
Returns a DataFrame of the same shape with True where values are missing.

In [3]:
df.isnull()

    Name    Age  Salary  JoinDate
0  False  False   False     False
1  False   True   False      True
2   True  False    True     False
3   True   True    True      True

In [4]:
# Count total missing values:
df.isnull().sum() # Column-wise count
df.isnull().sum().sum() # Total missing values

np.int64(8)

.fillna() ‚Äì Replace missing values
Replaces missing (NaN) values with a specified value or strategy.

In [5]:
 # Fill with constant value:
df.fillna(0)

    Name   Age   Salary             JoinDate
0  Alice  25.0  50000.0  2024-01-10 00:00:00
1    Bob   0.0  60000.0                    0
2      0  35.0      0.0  2024-03-15 00:00:00
3      0   0.0      0.0                    0

In [6]:
# Fill with column-specific values:
df.fillna({"Age":df["Age"].mean(), "Salary":0})

    Name   Age   Salary   JoinDate
0  Alice  25.0  50000.0 2024-01-10
1    Bob  30.0  60000.0        NaT
2   None  35.0      0.0 2024-03-15
3   None  30.0      0.0        NaT

In [7]:
# Forward fill (use previous row value):
df.fillna(method='ffill')

C:\Users\HELLO\AppData\Local\Temp\ipykernel_18660\2736038910.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

    Name   Age   Salary   JoinDate
0  Alice  25.0  50000.0 2024-01-10
1    Bob  25.0  60000.0 2024-01-10
2    Bob  35.0  60000.0 2024-03-15
3    Bob  35.0  60000.0 2024-03-15

In [8]:
# Backward fill (use next row value):
df.fillna(method='bfill')

C:\Users\HELLO\AppData\Local\Temp\ipykernel_18660\1739432019.py:2: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

    Name   Age   Salary   JoinDate
0  Alice  25.0  50000.0 2024-01-10
1    Bob  35.0  60000.0 2024-03-15
2   None  35.0      NaN 2024-03-15
3   None   NaN      NaN        NaT

.dropna() ‚Äì Remove rows or columns with missing data

In [9]:
# Drop rows with any missing values:
df.dropna()

    Name   Age   Salary   JoinDate
0  Alice  25.0  50000.0 2024-01-10

In [10]:
# Drop rows only if all values are missing:
df.dropna(how='all')

    Name   Age   Salary   JoinDate
0  Alice  25.0  50000.0 2024-01-10
1    Bob   NaN  60000.0        NaT
2   None  35.0      NaN 2024-03-15

In [14]:
# Drop columns with missing values:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [15]:
# Drop rows where specific column has missing value:
df.dropna(subset=['Age'])

    Name   Age   Salary   JoinDate
0  Alice  25.0  50000.0 2024-01-10
2   None  35.0      NaN 2024-03-15